import "./home.css";
import Wave from 'react-wavify';
import CountUp from 'react-countup';
import React, { useEffect, useState, useRef } from 'react';
import Loader from '../components/Loader';
function About() {
  useEffect(() => {
    setLoading(true);
    setTimeout(() => {
      setLoading(false);
    }, 1000)
  }, [])
  const [loading, setLoading] = useState(false);

  return (
    <>
      {loading ?

        <Loader
          // color={'#294a65'}
          loading={loading}
          // cssOverride={override}
          size={300}
        // aria-label="Loading Spinner"
        // data-testid="loader"
        // speedMultiplier={1.5}
        /> :
        <div className='aboutt'>

          <div className='about_us'>
            <ul id="Frames">
              <li class="Frame">
                <img src="https://i.postimg.cc/FH82tM1V/manish.jpg" alt="Hanafubuki - Cherry blossom blizzard" />
              </li>
            </ul>
            {/* <div className='img_manishji'></div> */}

            <h3 style={{ color: "#7d0a00", textAlign: "center", marginTop: "10px" }}>पं. मनीष चंद्रशेखर व्यास</h3>
            {/* <img  src={manishji} alt="" /> */}

            <div style={{ padding: "20px" }}>

              <h2 style={{ color: "#7d0a00" }}>उज्जैन महाकाल पूजा</h2>
              <p style={{ fontSize: "19.5px", padding: "10px", textAlign: "justify" }}>
                तीर्थ नगरी उज्जैन  में कालसर्प शांति पूजन ,मंगल दोष शांति पूजन, महामृत्युंजय जाप, महाकालेश्वर अभिषेक ,नागबलि नारायणवली पूजन ,पितृ दोष पूजन , ग्रहण दोष पूजन आदि कार्य वैदिक पद्दति द्वारा सम्पन्न कराये जाते  है।

                वैभवशालिनी उज्जयनी का महत्व धार्मिक एवं ऐतिहासिक द्रष्टि से बहुत बड़ा है मानावाक्रती भारत के मानचित्र में उज्जैन भारत के मध्यस्थान के भी मध्य (नाभिदेश) में स्थित है उपनिषदों और पुराणों में प्रमुख तीर्थ स्थानों को अश्यात्मिक स्वरुप देकर शरीर में ही स्थापित किया गया है तदनुसार अवंतिका उज्जैन को मनिपुर्चक्र अर्थात शरीर का नाभि प्रदेश बतलाया है और इस नभिदेश का अधिष्ठात देवता महाकालेश्वर को बतलाया है
                <ol>
                  <li>   महाभारत के वनपर्व में उल्लेख है की उज्जैन में एक महाकाल तीर्थ है वह कोटितीर्थ को स्पर्श करने से अश्वमेघ फल प्राप्त होता है</li>
                  <li>   आदिभ्रमपुराण में समग्र प्रथ्वी की नगरियो में उज्जैन को सर्वोत्तम नगरी बतलाया गया है</li>
                  <li>   गुरुडपुराण में कहा है की महाकाल तीर्थ समग्र पापो का नाश करने वाला और मुक्ति देने वाला है प्रथ्वी पर सात पूरी मोक्षदायक है उनमे अवंतिका श्रेष्ठ है</li>
                  <li>   शिवपुराण में लिखा गया है की भारत में शिव के १२ ज्योतिर्लिंग है जिनमे श्री महाकालेश्वर भी है इसनकी पूजा करके दर्शन करने की नीच गति का मनुष्य भी दुसरे जनम में शाश्त्रज्ञ ब्राहांण होता है |</li>
                  <li>   अग्निपुराण में बतलाया गया है की अवंतिकापुरी पापो को नाश करने वाली तथा भुक्ति और मुक्ति प्रदायनी है</li>
                  <li>  वामन पुराण में बतलाया है की प्रह्लाद में अवंतिका नगरी में जाकर शिप्रा में स्नान कर महाहकलेश्वर भगवान के दर्शन किये |</li>
                  <li>   विष्णु पुराण में एक महत्वपूर्ण वर्णन है की भगवान श्री कृष्ण अपने अग्रज बलराम और मित्र सुदामा के साथ अवंतिका में महा ऋषि संदीपनी के पास विद्या अध्यन करने आये थे उन्होंने छात्र अवस्था में ही गुरु की अत्यंत आदर पूर्वक विद्या अध्यन किया एवं संदीनी के चरणों में बैठकर १४ विधये और ६४ कलाए का अध्यन प्राप्त किया | उस समय काशी विद्या का केंद्र नहीं थी यही कारण है की गीता धर्म के प्रतिपादक योगिराज श्री कृष्ण व उनके अग्रज बलराम व मित्र सुदामा को अध्यन करने उज्जैन आना पड़ा |</li>
                  <li>   मंगल गृह की जन्भूमि होने का सोभाग्य भी उज्जैन को ही प्राप्त है| वराहमिहिर और महान विधुतपर आचार्य का जन्म भी यही हुआ था |</li>
                </ol>
                अवंतीका खंड के प्रथम अध्याय में यह तथ्य भी प्रकट किया गया है की महाकाल वन , पीठ, उषर, क्षेत्र और शमशान की स्तिथि होने से कोन सी विशेषताए व्यक्त होती है ? तब सनत कुमार कहते है की :-
                <ol>
                  <li> १. पातको के शिन होने से क्षेत्र कहलाता है </li>
                  <li> २. म्रतिकाओ का स्थान होने से इसे पीठ कहते है</li>
                  <li> ३. मरणोत्तर पूर्व जनम न होने से इसे उषर कहा जाता है</li>
                  <li> ४.शिव का नित्य प्रिय एवं ग्राह्य क्षेत्र होने से इसे शमशान कहा जाता है</li>
                  <li> ५. महाकल वन वाराणसी से १० गुना अधिक है एवं शिव का अतिप्रिय निवास स्थान है | यह पचो तत्व विश्व में अवंतिका नगरी के अलावा कही भी नहीं है|</li>
                </ol>  </p>
            </div>

          </div>

          <Wave fill='rgb(220, 38, 38)' style={{ position: "absolute" }}
            paused={false}
            options={{
              height: 10,
              amplitude: 20,
              speed: 0.15,
              points: 3
            }}
          />
          <div className='count_group'>
            <div className='count'>
              <CountUp start={0} end={15} delay={2}>
                {({ countUpRef }) => (
                  <div>
                    <span ref={countUpRef} />k+
                  </div>
                )}
              </CountUp>
              <h3>हमारे द्वारा की गयी पुजा</h3>
            </div>
            <div className='count'>
              <CountUp start={0} end={15} delay={2}>
                {({ countUpRef }) => (
                  <div>
                    <span ref={countUpRef} />
                  </div>
                )}
              </CountUp>
              <h3>साल का अनुभव</h3>
            </div>
            <div className='count'>
              <CountUp start={0} end={100} delay={2}>
                {({ countUpRef }) => (
                  <div>
                    <span ref={countUpRef} />%
                  </div>
                )}
              </CountUp>
              <h3>परिणाम</h3>
            </div>
          </div>

        </div>
      }
    </>
  )
}

export default About